coor=[[0,0],[0,0],[0,0]] #координаты вершин треугольника
for i in range(len(coor)): 
    print("введите x"+str(i+1))
    coor[i][0]=int(input())
    print("введите y"+str(i+1))
    coor[i][1]=int(input())
d=[0,0,0] #длины сторон треугольника

for i in range(3):
    if i<2:
        d[i]=((coor[i][0]-coor[i+1][0])**(2)+(coor[i][1]-coor[i+1][1])**(2))**(0.5)#расчет длины стороны треугольника по формуле |AB|² = (y2 - y1)² + (x2 - x1)²
    else:
        d[i]=((coor[i][0]-coor[0][0])**(2)+(coor[i][1]-coor[0][1])**(2))**(0.5) #Костыль
p=d[0]+d[1]+d[2]
S=(p/2*(p-d[0])*(p-d[1])*(p-d[2]))**(0.5)
print("Периметр треугольника равен "+str(p))
print ("плошадь треугольника равна "+str(S))
